<template>
  <BreadcrumbsComponent
    back-path="/GuidesPage"
    back-text="📖 Гайды "
    current-page="Кавеха"
    class="ml-[10px]"
  />
  <div class="md:w-[1200px] rounded-[20px] mt-[14px] bg-[#080C20B2] border border-[#00EEFF4D]">
    <div class="md:grid grid-cols-[60%_40%]">
      <div>
        <h1 class="text-[28px] md:text-[40px] m-[21px] md:m-[42px] text-white md:leading-[50px]">
          Гайд на Кавеха: в какие отряды его поставить и как его собрать?
        </h1>
        <div class="h-px bg-[#00EEFF99] mx-[21px] md:mx-[42px]"></div>
        <p
          class="text-[18px] text-white mx-[21px] md:mx-[42px] py-[25px] md:py-[40px] leading-[30px]"
        >
          Кавех — Дендро персонаж из Сумеру, владеющий двуручным оружием. Он специализируется на
          взрыве бутонов вокруг себя и может самостоятельно восстанавливать HP. Он проводит много
          времени на поле боя и ближе к понятию основного дамагера, но в то же время он командный
          персонаж, которому требуются Гидро персонажи в отряд. В сюжете он уже продемонстрировал
          личный рост и изменение привычек: он перестал много пить и в большей степени перешёл на
          кофе.
        </p>
        <div class="h-px bg-[#00EEFF99] mx-[21px] md:mx-[42px]"></div>
      </div>
      <div>
        <img
          src="@/assets/kaveha.png"
          class="mt-[25px] md:mt-[10px] px-[20px] md:px-0 mx-auto md:mx-0"
        />
      </div>
    </div>
    <h2 class="text-[24px] mt-[21px] md:mt-[53px] ml-[21px] md:ml-[43px] text-white">
      Навыки персонажа
    </h2>
    <p
      class="text-[16px] text-white mx-[21px] md:mx-[43px] py-[25px] md:py-[38px] leading-[30px] md:w-[70%] font-normal"
    >
      Обычная атака выполняет до четырёх ударов. Элементальный навык наносит Дендро урон по площади
      и взрывает ближайшие Дендро ядра. Время отката элементального навыка составляет 6 секунд.
    </p>
    <img src="@/assets/kaveha-skills.png" class="md:mx-auto px-[20px] md:px-0" />
    <p
      class="text-[16px] text-white mx-[21px] md:mx-[43px] py-[25px] md:py-[49px] leading-[30px] md:w-[70%] font-normal"
    >
      Взрыв стихии наносит Дендро урон по площади и взрывает все Дендро ядра в её пределах. Кавех
      получает некоторые бонусы — он получает Дендро инфузию, которую нельзя сбить другими типами
      инфузий, а область поражения обычных, заряженных и атак в падении увеличивается. В таком
      состоянии также повышается урон взрываемых Дендро ядер после реакции Бутонизации или Лунной
      Бутонизации. Также у Кавеха повышается сопротивление прерыванию. Все названные эффекты длятся
      12 секунд или пока Кавех не покинет поле боя. Активация взрыва стихии стоит 80 единиц, а время
      отката — 20 секунд.
    </p>
    <img src="@/assets/kaveha2.png" class="mt-[10px] px-[20px] md:px-0 md:mx-auto" />
    <h2
      class="text-[24px] md:text-[34px] ml-[21px] md:ml-[42px] mt-[21px] md:mt-[75px] mb-[21px] md:mb-[56px] text-white text-nowrap"
    >
      Recommended Weapons
    </h2>

    <WeaponBlock />
    <div class="ml-[25px] md:ml-[50px] mr-[25px]">
      <LinksComponent />
    </div>
  </div>
  <div>
    <h3 class="text-[30px] mt-[82px] text-white hidden md:flex">📖 Смотрите также:</h3>
  </div>
  <GuideBlock class="hidden md:grid" />
</template>

<script setup>
import LinksComponent from '@/components/base/BaseLinks.vue'
import BreadcrumbsComponent from '@/components/ui/UiBreadcrumbs.vue'
import WeaponBlock from '@/components/block/BlockWeapon.vue'
import GuideBlock from '@/components/block/BlockGuide.vue'
</script>
